Revit 2027 API
ParameterTypeId.TextAlignHorz Property
 "Horizontal Align"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TextAlignHorz { get; }
Public Shared ReadOnly Property TextAlignHorz As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TextAlignHorz {
	ForgeTypeId^ get ();
}
static member TextAlignHorz : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace